import Image from "next/image";
import { SideBar } from "./components/SideBar";

export default function Home() {
  return (
    <>
      <SideBar />
      <main className="p-4 sm:mr-60">
        <h1 className="text-3xl font-bold ">الصفحة الرئيسية</h1>
        <div className="p-4 border-2 my-4 border-gray-200 border-dashed rounded-lg dark:border-gray-700">
          <h1 className="text-lg font-semibold text-gray-900 dark:text-white">
            التعريف
          </h1>
          <p className="mt-2 text-sm text-gray-500 dark:text-gray-400">
            لكن لا بد أن أوضح لك أن كل هذه الأفكار المغلوطة حول استنكار النشوة
            وتمجيد الألم نشأت بالفعل، وسأعرض لك التفاصيل لتكتشف حقيقة وأساس تلك
            السعادة البشرية، فلا أحد يرفض أو يكره أو يتجنب الشعور بالسعادة، ولكن
            بفضل هؤلاء الأشخاص الذين لا يدركون بأن السعادة لا بد أن نستشعرها
            بصورة أكثر عقلانية ومنطقية فيعرضهم هذا لمواجهة الظروف الأليمة، وأكرر
            بأنه لا يوجد من يرغب في الحب ونيل المنال ويتلذذ بالآلام، الألم هو
            الألم ولكن نتيجة لظروف ما قد تكمن السعاده فيما نتحمله من كد وأسي.
          </p>
        </div>
        <div className="p-4 border-2 my-4 border-gray-200 border-dashed rounded-lg dark:border-gray-700">
          <h1 className="text-lg font-semibold text-gray-900 dark:text-white">
            الإطار
          </h1>
          <p className="mt-2 text-sm text-gray-500 dark:text-gray-400">
            لكن لا بد أن أوضح لك أن كل هذه الأفكار المغلوطة حول استنكار النشوة
            وتمجيد الألم نشأت بالفعل، وسأعرض لك التفاصيل لتكتشف حقيقة وأساس تلك
            السعادة البشرية، فلا أحد يرفض أو يكره أو يتجنب الشعور بالسعادة، ولكن
            بفضل هؤلاء الأشخاص الذين لا يدركون بأن السعادة لا بد أن نستشعرها
            بصورة أكثر عقلانية ومنطقية فيعرضهم هذا لمواجهة الظروف الأليمة، وأكرر
            بأنه لا يوجد من يرغب في الحب ونيل المنال ويتلذذ بالآلام، الألم هو
            الألم ولكن نتيجة لظروف ما قد تكمن السعاده فيما نتحمله من كد وأسي.
          </p>
        </div>
        <div className="p-4 border-2 my-4 border-gray-200 border-dashed rounded-lg dark:border-gray-700">
          <h1 className="text-lg font-semibold text-gray-900 dark:text-white">
            الميثاق
          </h1>
          <p className="mt-2 text-sm text-gray-500 dark:text-gray-400">
            لكن لا بد أن أوضح لك أن كل هذه الأفكار المغلوطة حول استنكار النشوة
            وتمجيد الألم نشأت بالفعل، وسأعرض لك التفاصيل لتكتشف حقيقة وأساس تلك
            السعادة البشرية، فلا أحد يرفض أو يكره أو يتجنب الشعور بالسعادة، ولكن
            بفضل هؤلاء الأشخاص الذين لا يدركون بأن السعادة لا بد أن نستشعرها
            بصورة أكثر عقلانية ومنطقية فيعرضهم هذا لمواجهة الظروف الأليمة، وأكرر
            بأنه لا يوجد من يرغب في الحب ونيل المنال ويتلذذ بالآلام، الألم هو
            الألم ولكن نتيجة لظروف ما قد تكمن السعاده فيما نتحمله من كد وأسي.
          </p>
        </div>
      </main>
    </>
  );
}
